"""https://github.com/fzl666/fzl"""

import random

from nonebot import on_command

from src.utils.doc import CommandCategory, command_doc


class SubcultureNamingMachine:

    A = [
        "废墟", "深海", "反应堆", "学园", "腐烂", "东京", "三维", "四次元", "少管所", "流星", "闪光",
        "南极", "消极", "幽浮", "网路", "暗狱", "离子态", "液态", "黑色", "抱抱", "暴力", "垃圾",
        "社会", "残暴", "残酷", "工口", "原味", "毛茸茸", "香香", "霹雳", "午夜", "美工刀", "爆浆",
        "机关枪", "无响应", "手术台", "虚拟", "速冻", "智能", "甜味", "华丽", "玛利亚", "无", "梦之",
        "蔷薇", "无政府", "酷酷", "西伯利亚", "人造", "法外", "追杀", "通缉", "女子", "微型", "男子",
        "超", "毁灭", "大型", "绝望", "高科技", "奇妙", "魔法", "极限", "无聊", "邪恶", "不良"
    ]
    B = [
        "小丑", "仿生", "纳米", "原子", "丧", "电子", "十字架", "咩咩", "赛博", "野猪", "外星", "窒息",
        "变态", "触手", "小众", "悲情", "飞行", "绿色", "电动", "铁锈", "电音", "蠕动", "酸甜", "虚构",
        "乱码", "碳水", "全裸", "绷带", "不合格", "光滑", "标本", "酸性", "碱性", "404", "变身",
        "反常", "樱桃", "碳基", "矫情", "病娇", "进化", "潮湿", "砂糖", "高潮", "变异", "复合盐",
        "伏特加", "抑郁", "暴躁", "不爱说话", "废物", "失败", "幻想型", "社恐", "苦涩", "粘液", "浓厚",
        "快乐", "强制", "中二病", "恶魔", "emo", "激光", "发射", "限量版", "迷因", "堕落", "放射性",
        "水晶", "乐观", "吸血", "喷射", "剧毒", "机械"
    ]
    C = [
        "天使", "精灵", "女孩", "男孩", "宝贝", "虫", "菇", "公主", "少女", "少年", "1号机", "子",
        "恐龙", "蜈蚣", "蟑螂", "食人鱼", "小飞船", "舞女", "桃子", "团子", "精", "酱", "废料", "生物",
        "物质", "奶茶", "搅拌机", "液", "火锅", "祭司", "体", "实验品", "试验体", "小猫咪", "样本",
        "颗粒", "汽水", "蛙", "软体", "机器人", "人质", "小熊", "圣母", "胶囊", "乙女", "主义者", "屑",
        "污渍", "废人", "肉", "河豚", "豚", "藻类", "咒语", "建筑", "球", "小狗", "碳", "元素",
        "博士", "糖", "男娘", "妖精", "爬虫", "行星", "鬼"
    ]
    PART = [A, B, C]

    @staticmethod
    def generate() -> str:
        return "".join(
            random.choice(part) for part in SubcultureNamingMachine.PART)


naming = on_command("取名", block=True, force_whitespace=True)


@naming.handle()
@command_doc("取名", category=CommandCategory.FUN)
async def _():
    """
    高科技亚文化取名机

    Examples:
        >>> {cmd}
        绝望潮湿小猫咪

    Notes:
        - 来源: [https://github.com/fzl666/fzl](https://github.com/fzl666/fzl)
        - ~~永远缅怀wyrio~~
    """
    await naming.finish(SubcultureNamingMachine.generate())
